{"class_name": "Model", "keras_version": "2.0.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 321, 321, 3], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Cropping2D", "config": {"cropping": [[11, 11], [11, 11]], "trainable": true, "name": "cropping2d_1", "data_format": "channels_last"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "cropping2d_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["cropping2d_1", 0, 0, {}]]], "name": "conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "arelu1"}, "inbound_nodes": [[["bn1", 0, 0, {}]]], "name": "arelu1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["arelu1", 0, 0, {}]]], "name": "conv2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2", 0, 0, {}]]], "name": "bn2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "arelu2"}, "inbound_nodes": [[["bn2", 0, 0, {}]]], "name": "arelu2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["arelu2", 0, 0, {}]]], "name": "conv3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv3", 0, 0, {}]]], "name": "bn3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "arelu3"}, "inbound_nodes": [[["bn3", 0, 0, {}]]], "name": "arelu3"}, {"class_name": "MaxPooling2D", "config": {"name": "mp1", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["arelu3", 0, 0, {}]]], "name": "mp1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv4", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["mp1", 0, 0, {}]]], "name": "conv4"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv4", 0, 0, {}]]], "name": "bn4"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "arelu4"}, "inbound_nodes": [[["bn4", 0, 0, {}]]], "name": "arelu4"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv5", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["arelu4", 0, 0, {}]]], "name": "conv5"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn5", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv5", 0, 0, {}]]], "name": "bn5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "arelu5"}, "inbound_nodes": [[["bn5", 0, 0, {}]]], "name": "arelu5"}, {"class_name": "MaxPooling2D", "config": {"name": "mp2", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["arelu5", 0, 0, {}]]], "name": "mp2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "mixed_5b/branch_2_1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["mp2", 0, 0, {}]]], "name": "mixed_5b/branch_2_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "mixed_5b/bn.branch_2.1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["mixed_5b/branch_2_1", 0, 0, {}]]], "name": "mixed_5b/bn.branch_2.1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "arelu9"}, "inbound_nodes": [[["mixed_5b/bn.branch_2.1", 0, 0, {}]]], "name": "arelu9"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "mixed_5b/branch_1_1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["mp2", 0, 0, {}]]], "name": "mixed_5b/branch_1_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "mixed_5b/branch_2_2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["arelu9", 0, 0, {}]]], "name": "mixed_5b/branch_2_2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "mixed_5b/bn.branch_1.1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["mixed_5b/branch_1_1", 0, 0, {}]]], "name": "mixed_5b/bn.branch_1.1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "mixed_5b/bn.branch_2.2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["mixed_5b/branch_2_2", 0, 0, {}]]], "name": "mixed_5b/bn.branch_2.2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "arelu7"}, "inbound_nodes": [[["mixed_5b/bn.branch_1.1", 0, 0, {}]]], "name": "arelu7"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "arelu10"}, "inbound_nodes": [[["mixed_5b/bn.branch_2.2", 0, 0, {}]]], "name": "arelu10"}, {"class_name": "AveragePooling2D", "config": {"name": "ap1", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "inbound_nodes": [[["mp2", 0, 0, {}]]], "name": "ap1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "mixed_5b/branch_0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["mp2", 0, 0, {}]]], "name": "mixed_5b/branch_0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "mixed_5b/branch_1_2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["arelu7", 0, 0, {}]]], "name": "mixed_5b/branch_1_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "mixed_5b/branch_2_3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["arelu10", 0, 0, {}]]], "name": "mixed_5b/branch_2_3"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "mixed_5b/branch_pool_1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["ap1", 0, 0, {}]]], "name": "mixed_5b/branch_pool_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "mixed_5b/bn.branch_0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["mixed_5b/branch_0", 0, 0, {}]]], "name": "mixed_5b/bn.branch_0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "mixed_5b/bn.branch_1.2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["mixed_5b/branch_1_2", 0, 0, {}]]], "name": "mixed_5b/bn.branch_1.2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "mixed_5b/bn.branch_2.3", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["mixed_5b/branch_2_3", 0, 0, {}]]], "name": "mixed_5b/bn.branch_2.3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "mixed_5b/bn.branch_pool_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["mixed_5b/branch_pool_1", 0, 0, {}]]], "name": "mixed_5b/bn.branch_pool_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "arelu6"}, "inbound_nodes": [[["mixed_5b/bn.branch_0", 0, 0, {}]]], "name": "arelu6"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "arelu8"}, "inbound_nodes": [[["mixed_5b/bn.branch_1.2", 0, 0, {}]]], "name": "arelu8"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "arelu11"}, "inbound_nodes": [[["mixed_5b/bn.branch_2.3", 0, 0, {}]]], "name": "arelu11"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "arelu12"}, "inbound_nodes": [[["mixed_5b/bn.branch_pool_1", 0, 0, {}]]], "name": "arelu12"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "mixed_5b", "axis": 3}, "inbound_nodes": [[["arelu6", 0, 0, {}], ["arelu8", 0, 0, {}], ["arelu11", 0, 0, {}], ["arelu12", 0, 0, {}]]], "name": "mixed_5b"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block35/branch_2_1/1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["mixed_5b", 0, 0, {}]]], "name": "block35/branch_2_1/1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block35/bn_branch_2_1/1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block35/branch_2_1/1", 0, 0, {}]]], "name": "block35/bn_branch_2_1/1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block35/branch_2_1/relu/1"}, "inbound_nodes": [[["block35/bn_branch_2_1/1", 0, 0, {}]]], "name": "block35/branch_2_1/relu/1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block35/branch_1_1/1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["mixed_5b", 0, 0, {}]]], "name": "block35/branch_1_1/1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block35/branch_2_2/1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block35/branch_2_1/relu/1", 0, 0, {}]]], "name": "block35/branch_2_2/1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block35/bn_branch_1_1/1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block35/branch_1_1/1", 0, 0, {}]]], "name": "block35/bn_branch_1_1/1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block35/bn_branch_2_2/1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block35/branch_2_2/1", 0, 0, {}]]], "name": "block35/bn_branch_2_2/1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block35/branch_1_1/relu/1"}, "inbound_nodes": [[["block35/bn_branch_1_1/1", 0, 0, {}]]], "name": "block35/branch_1_1/relu/1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block35/branch_2_2/relu/1"}, "inbound_nodes": [[["block35/bn_branch_2_2/1", 0, 0, {}]]], "name": "block35/branch_2_2/relu/1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block35/branch_0/1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["mixed_5b", 0, 0, {}]]], "name": "block35/branch_0/1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block35/branch_1_2/1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block35/branch_1_1/relu/1", 0, 0, {}]]], "name": "block35/branch_1_2/1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block35/branch_2_3/1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block35/branch_2_2/relu/1", 0, 0, {}]]], "name": "block35/branch_2_3/1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block35/bn_branch_0/1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block35/branch_0/1", 0, 0, {}]]], "name": "block35/bn_branch_0/1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block35/bn_branch_1_2/1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block35/branch_1_2/1", 0, 0, {}]]], "name": "block35/bn_branch_1_2/1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block35/bn_branch_2_3/1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block35/branch_2_3/1", 0, 0, {}]]], "name": "block35/bn_branch_2_3/1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block35/branch_0/relu/1"}, "inbound_nodes": [[["block35/bn_branch_0/1", 0, 0, {}]]], "name": "block35/branch_0/relu/1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block35/branch_1_2/relu/1"}, "inbound_nodes": [[["block35/bn_branch_1_2/1", 0, 0, {}]]], "name": "block35/branch_1_2/relu/1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block35/branch_2_3/relu/1"}, "inbound_nodes": [[["block35/bn_branch_2_3/1", 0, 0, {}]]], "name": "block35/branch_2_3/relu/1"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "block35_1_mixed", "axis": 3}, "inbound_nodes": [[["block35/branch_0/relu/1", 0, 0, {}], ["block35/branch_1_2/relu/1", 0, 0, {}], ["block35/branch_2_3/relu/1", 0, 0, {}]]], "name": "block35_1_mixed"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block35_1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 320, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block35_1_mixed", 0, 0, {}]]], "name": "block35_1_conv"}, {"class_name": "Lambda", "config": {"function": ["c\u0002\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0003\u0000\u0000\u0000S\u0000\u0000\u0000s\u0014\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019|\u0000\u0000d\u0002\u0000\u0019|\u0001\u0000\u0014\u0017S(\u0003\u0000\u0000\u0000Ni\u0000\u0000\u0000\u0000i\u0001\u0000\u0000\u0000(\u0000\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\u0006\u0000\u0000\u0000inputst\u0005\u0000\u0000\u0000scale(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s0\u0000\u0000\u0000/ai/sources/keras.ins.facenet/inceptionresnet.pyt\b\u0000\u0000\u0000<lambda>N\u0000\u0000\u0000t\u0000\u0000\u0000\u0000", null, null], "name": "block35_1", "trainable": true, "function_type": "lambda", "arguments": {"scale": 0.17}, "output_shape": [35, 35, 320], "output_shape_type": "raw"}, "inbound_nodes": [[["mixed_5b", 0, 0, {}], ["block35_1_conv", 0, 0, {}]]], "name": "block35_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block35_1_ac"}, "inbound_nodes": [[["block35_1", 0, 0, {}]]], "name": "block35_1_ac"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block35/branch_2_1/2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block35_1_ac", 0, 0, {}]]], "name": "block35/branch_2_1/2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block35/bn_branch_2_1/2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block35/branch_2_1/2", 0, 0, {}]]], "name": "block35/bn_branch_2_1/2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block35/branch_2_1/relu/2"}, "inbound_nodes": [[["block35/bn_branch_2_1/2", 0, 0, {}]]], "name": "block35/branch_2_1/relu/2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block35/branch_1_1/2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block35_1_ac", 0, 0, {}]]], "name": "block35/branch_1_1/2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block35/branch_2_2/2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block35/branch_2_1/relu/2", 0, 0, {}]]], "name": "block35/branch_2_2/2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block35/bn_branch_1_1/2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block35/branch_1_1/2", 0, 0, {}]]], "name": "block35/bn_branch_1_1/2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block35/bn_branch_2_2/2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block35/branch_2_2/2", 0, 0, {}]]], "name": "block35/bn_branch_2_2/2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block35/branch_1_1/relu/2"}, "inbound_nodes": [[["block35/bn_branch_1_1/2", 0, 0, {}]]], "name": "block35/branch_1_1/relu/2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block35/branch_2_2/relu/2"}, "inbound_nodes": [[["block35/bn_branch_2_2/2", 0, 0, {}]]], "name": "block35/branch_2_2/relu/2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block35/branch_0/2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block35_1_ac", 0, 0, {}]]], "name": "block35/branch_0/2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block35/branch_1_2/2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block35/branch_1_1/relu/2", 0, 0, {}]]], "name": "block35/branch_1_2/2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block35/branch_2_3/2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block35/branch_2_2/relu/2", 0, 0, {}]]], "name": "block35/branch_2_3/2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block35/bn_branch_0/2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block35/branch_0/2", 0, 0, {}]]], "name": "block35/bn_branch_0/2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block35/bn_branch_1_2/2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block35/branch_1_2/2", 0, 0, {}]]], "name": "block35/bn_branch_1_2/2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block35/bn_branch_2_3/2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block35/branch_2_3/2", 0, 0, {}]]], "name": "block35/bn_branch_2_3/2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block35/branch_0/relu/2"}, "inbound_nodes": [[["block35/bn_branch_0/2", 0, 0, {}]]], "name": "block35/branch_0/relu/2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block35/branch_1_2/relu/2"}, "inbound_nodes": [[["block35/bn_branch_1_2/2", 0, 0, {}]]], "name": "block35/branch_1_2/relu/2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block35/branch_2_3/relu/2"}, "inbound_nodes": [[["block35/bn_branch_2_3/2", 0, 0, {}]]], "name": "block35/branch_2_3/relu/2"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "block35_2_mixed", "axis": 3}, "inbound_nodes": [[["block35/branch_0/relu/2", 0, 0, {}], ["block35/branch_1_2/relu/2", 0, 0, {}], ["block35/branch_2_3/relu/2", 0, 0, {}]]], "name": "block35_2_mixed"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block35_2_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 320, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block35_2_mixed", 0, 0, {}]]], "name": "block35_2_conv"}, {"class_name": "Lambda", "config": {"function": ["c\u0002\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0003\u0000\u0000\u0000S\u0000\u0000\u0000s\u0014\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019|\u0000\u0000d\u0002\u0000\u0019|\u0001\u0000\u0014\u0017S(\u0003\u0000\u0000\u0000Ni\u0000\u0000\u0000\u0000i\u0001\u0000\u0000\u0000(\u0000\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\u0006\u0000\u0000\u0000inputst\u0005\u0000\u0000\u0000scale(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s0\u0000\u0000\u0000/ai/sources/keras.ins.facenet/inceptionresnet.pyt\b\u0000\u0000\u0000<lambda>N\u0000\u0000\u0000t\u0000\u0000\u0000\u0000", null, null], "name": "block35_2", "trainable": true, "function_type": "lambda", "arguments": {"scale": 0.17}, "output_shape": [35, 35, 320], "output_shape_type": "raw"}, "inbound_nodes": [[["block35_1_ac", 0, 0, {}], ["block35_2_conv", 0, 0, {}]]], "name": "block35_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block35_2_ac"}, "inbound_nodes": [[["block35_2", 0, 0, {}]]], "name": "block35_2_ac"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block35/branch_2_1/3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block35_2_ac", 0, 0, {}]]], "name": "block35/branch_2_1/3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block35/bn_branch_2_1/3", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block35/branch_2_1/3", 0, 0, {}]]], "name": "block35/bn_branch_2_1/3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block35/branch_2_1/relu/3"}, "inbound_nodes": [[["block35/bn_branch_2_1/3", 0, 0, {}]]], "name": "block35/branch_2_1/relu/3"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block35/branch_1_1/3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block35_2_ac", 0, 0, {}]]], "name": "block35/branch_1_1/3"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block35/branch_2_2/3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block35/branch_2_1/relu/3", 0, 0, {}]]], "name": "block35/branch_2_2/3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block35/bn_branch_1_1/3", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block35/branch_1_1/3", 0, 0, {}]]], "name": "block35/bn_branch_1_1/3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block35/bn_branch_2_2/3", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block35/branch_2_2/3", 0, 0, {}]]], "name": "block35/bn_branch_2_2/3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block35/branch_1_1/relu/3"}, "inbound_nodes": [[["block35/bn_branch_1_1/3", 0, 0, {}]]], "name": "block35/branch_1_1/relu/3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block35/branch_2_2/relu/3"}, "inbound_nodes": [[["block35/bn_branch_2_2/3", 0, 0, {}]]], "name": "block35/branch_2_2/relu/3"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block35/branch_0/3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block35_2_ac", 0, 0, {}]]], "name": "block35/branch_0/3"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block35/branch_1_2/3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block35/branch_1_1/relu/3", 0, 0, {}]]], "name": "block35/branch_1_2/3"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block35/branch_2_3/3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block35/branch_2_2/relu/3", 0, 0, {}]]], "name": "block35/branch_2_3/3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block35/bn_branch_0/3", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block35/branch_0/3", 0, 0, {}]]], "name": "block35/bn_branch_0/3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block35/bn_branch_1_2/3", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block35/branch_1_2/3", 0, 0, {}]]], "name": "block35/bn_branch_1_2/3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block35/bn_branch_2_3/3", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["block35/branch_2_3/3", 0, 0, {}]]], "name": "block35/bn_branch_2_3/3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block35/branch_0/relu/3"}, "inbound_nodes": [[["block35/bn_branch_0/3", 0, 0, {}]]], "name": "block35/branch_0/relu/3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": 